[{
  "_id": {
    "$oid": "6570a2880e7079ef5eaba876"
  },
  "userid": "6570a1410e7079ef5eaba860",
  "title": "Israel says it is engaged in the heaviest fighting yet in Gaza",
  "link": "https://flipboard.com/topic/news/israel-says-it-is-engaged-in-the-heaviest-fighting-yet-in-gaza/a-SZIGpFKBTCiNG9DBf7gsnQ%3Aa%3A43591897-9c8d466a67%2Fnpr.org",
  "content": "TEL AVIV, Israel — Some of the heaviest fighting since the start of Israel's air-and-ground assault on Gaza was taking place Wednesday in Khan Younis, with artillery shelling and gunfire echoing through the Palestinian territory's second-largest city.",
  "upvote": 5,
  "downvote": 1,
  "replies": [
    {
      "$oid": "65715f04d3f0f8420e26a78d"
    }
  ],
  "noofreplies": 2,
  "createdAt": {
    "$date": "2023-12-06T16:34:16.835Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:08:44.866Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6570a2d97ebb16eab30a8d76"
  },
  "userid": "65708d1aab8bf77685f92acc",
  "title": "New T20 Bowler",
  "link": "https://www.cricbuzz.com/profiles/14659/ravi-bishnoi",
  "content": "Indian leg-spinner Ravi Bishnoi has risen to the top position in the ICC T2OI bowling chart, following a standout performance and 'Player of the Series' award in the series against Australia.",
  "upvote": 7,
  "downvote": 0,
  "replies": [
    {
      "$oid": "6570a30a0e7079ef5eaba8bb"
    },
    {
      "$oid": "657162edd3f0f8420e26a86d"
    }
  ],
  "noofreplies": 7,
  "createdAt": {
    "$date": "2023-12-06T16:35:37.989Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T09:38:04.638Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6570d45f553a24441da35fde"
  },
  "userid": "6570a2820e7079ef5eaba874",
  "title": "Meta to discontinue cross-app communication chats on Instagram",
  "link": "https://www.zeebiz.com/technology/news-meta-to-discontinue-cross-app-communication-chats-on-instagram-267695",
  "content": "Meta is set to discontinue the \"cross-app communication chats\" feature, allowing users to chat with Facebook friends on Instagram. The company has announced that, starting in mid-December 2023, this feature, introduced in 2020, will be disconnected.  On its support page, Meta informed users, \"Beginning in mid-December 2023, you will no longer be able to chat with Facebook accounts on Instagram.\" While the company did not explicitly state the reason behind this decision, speculations from sources like 9to5Google suggest that it could be a strategic move to avoid potential regulatory issues in the European Union (EU).  Following the removal of the cross-app communication feature, users will be unable to initiate new conversations or calls with Facebook accounts from Instagram. Existing chats on Instagram involving Facebook accounts will become read-only, even if those Facebook accounts are removed from the chat. This means that users, along with others having Instagram accounts, won't be able to send new messages in these chats.",
  "upvote": 1,
  "downvote": 1,
  "replies": [
    {
      "$oid": "657162a1d3f0f8420e26a84c"
    }
  ],
  "noofreplies": 2,
  "createdAt": {
    "$date": "2023-12-06T20:06:55.883Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:07:56.197Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571621cd3f0f8420e26a80a"
  },
  "userid": "657160c6d3f0f8420e26a801",
  "title": "Chennai flooded as heavy rains from cyclone Michaung batter south India",
  "link": "",
  "content": "CHENNAI/HYDERABAD, Dec 6 (Reuters) - Rescuers used boats to reach people stranded in their homes amid widespread flooding in the India's Chennai on Wednesday after cyclone Michaung barrelled into the southern coast, bringing in heavy rain and winds that uprooted trees and damaged roads.  An estimated 13 people, most of them in the manufacturing hub of Tamil Nadu, have died in the flooding that was triggered by the torrential rains that preceded the cyclone, which made landfall in Andhra Pradesh state on Tuesday afternoon.",
  "upvote": 2,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717080d3f0f8420e26ab09"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T06:11:40.644Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:07:09.106Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571626ad3f0f8420e26a821"
  },
  "userid": "657160c6d3f0f8420e26a801",
  "title": "After break due to poor air quality, winter vacation in city schools shortened to 6 days",
  "link": "https://indianexpress.com/article/cities/delhi/delhi-news-live-updates-air-quality-schools-winter-cm-kejriwal-9057769/",
  "content": "Delhi News Live Updates (December 7): The Delhi government has cut short the winter vacation in schools from 15 to six days. As per a circular from the Directorate of Education, a portion of the winter break was given from November 9-18 due to the poor air quality in the city. Now, the remaining vacation days will be observed from January 1-6. Earlier, it was scheduled to take place from January 1-15.  The Delhi Police is on high alert after US-based Khalistani supporter Gurpatwant Singh Pannun purportedly released a video threatening to “shake the foundation of parliament” on December 13, the anniversary of the 2001 Parliament attack. This comes closely on the heels of the US’s accusation that India attempted to assassinate the Khalistani leader. Senior Delhi Police officers said extra security has been deployed around Central and New Delhi district areas, and in and around Parliament to prevent any possible breach of law and order  Here’s a weather update: The minimum temperature was at 9.2 degrees Celsius early this morning . There will be clear skies with shallow to moderate fog in the morning across the city till December 11, as per the India Meteorological Department (IMD). The AQI at 9 am was 297, in the upper end of the ‘poor’ category. It has remained in the ‘poor’ category for the past two days.",
  "upvote": 0,
  "downvote": 1,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T06:12:58.772Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:07:05.260Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571645cd3f0f8420e26a89b"
  },
  "userid": "657163f1d3f0f8420e26a896",
  "title": "India beat South Korea in Junior Hockey World Cup",
  "link": "https://www.espn.in/espn/story/_/id/39041495/indian-sports-live-news-updates-scores-results-commentary-tuesday-december-5",
  "content": "The Indian men's junior hockey team is off to a good start in Kuala Lumpur. Playing their first match of the World Cup, India controlled the proceedings and secured a 4-2 win over South Korea.  Araijeet Singh Hundal was the star of the match as he scored a superb hat trick. His clinical finishing made a big difference in the match as India started strongly and took a two-goal lead. He added one more in the third quarter to complete his hat trick. Amandeep scored the other goal for India while Lim Dohyun and Kim Minkwon netted for South Korea.  India will next play Spain on Thursday who had earlier beaten Canada 7-0 on Tuesday.",
  "upvote": 4,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T06:21:16.070Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:06:56.432Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "657164d3d3f0f8420e26a8a1"
  },
  "userid": "657163f1d3f0f8420e26a896",
  "title": "Three dead including the shooter, one injured in University of Nevada, Las Vegas attack The attack sent police swarming onto the campus while students and professors barricaded themselves inside classrooms and dorm rooms",
  "link": "https://www.thehindu.com/news/international/several-dead-and-wounded-and-shooter-also-dead-in-university-of-nevada-las-vegas-attack/article67613413.ece",
  "content": " Three people were shot to death and a fourth critically wounded Wednesday in an attack at the University of Nevada, Las Vegas that sent shock waves through a city still scarred by the deaths of 60 people in a 2017 shooting only a few miles away on the famous Strip. The suspected shooter also was found dead.   The attack at about 11:45 a.m. sent police swarming onto the campus while students and professors barricaded themselves inside classrooms and dorm rooms.  Authorities gave the all-clear about 40 minutes after the first report of an active shooter. Adam Garcia, a university police official, said officers found and “engaged” a suspect, who is now dead. It wasn’t immediately clear how the suspect died.  Police also didn’t immediately release any details about the victims, the suspect or a possible motive.",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T06:23:15.533Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:06:53.382Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716550d3f0f8420e26a8a7"
  },
  "userid": "657163f1d3f0f8420e26a896",
  "title": "\"Can't Let Putin Win\": Joe Biden Urges Republicans For Ukraine Aid",
  "link": "https://www.ndtv.com/world-news/russia-ukraine-war-usa-russia-cant-let-vladimir-putin-win-joe-biden-urges-republicans-for-ukraine-military-aid-4640993",
  "content": "Washington: President Joe Biden pleaded with Republicans on Wednesday for a fresh infusion of military aid for Ukraine, warning that a victory for Russia over Ukraine would leave Moscow in position to attack NATO allies and could draw U.S. troops into a war. Biden spoke as the United States planned to announce $175 million in additional Ukraine aid from its dwindling supply of money for Kyiv. He signaled a willingness to make significant changes to U.S. migration policy along the border with Mexico to try to draw Republican support.  \"If Putin takes Ukraine, he won't stop there,\" Biden said. Putin will attack a NATO ally, he predicted, and then \"we'll have something that we don't seek and that we don't have today: American troops fighting Russian troops,\" Biden said.  \"We can't let Putin win,\" he said.  However, Senate Republicans later on Wednesday blocked Democratic-backed legislation that would have provided billions of dollars in new security assistance for Ukraine and Israel, among other international concerns, saying they wanted to press their point about the importance of tighter border policy.  The White House warned this week that the U.S. is running out of time and money to help Ukraine repel Russia's invasion.  White House national security adviser Jake Sullivan, in a phone interview with Reuters about building up Ukraine's defense industrial base, said the U.S. was sticking to its long-held position not to pressure Ukraine into negotiations with Russia.  \"That's going to have to be up to them. We're just going to keep fighting day in and day out to try to secure this money,\" Sullivan said.  \"We're going to keep making the case that it would be a historic mistake for the United States to walk away from Ukraine at this moment and we believe that argument will ultimately penetrate and prevail,\" he said.  He said Biden is prepared to have \"reasonable, responsible discussions to produce a bipartisan outcome on border policy and border sources.\"  By mid-November, the U.S. Defense Department had used 97% of $62.3 billion in supplemental funding it had received and the State Department had used all of the $4.7 billion in military assistance funding it had been allocated, U.S. budget director Shalanda Young said this week.  A U.S. official said Washington has less than $1 billion in \"replenishment authority.\" This means that if Congress does not provide new funds to buy replacement equipment, the U.S., Ukraine and arms makers may have to take other steps to backfill stocks.  Border security with Mexico is a major issue weighing on the negotiations about Ukraine and Israel funding.  House and Senate Republicans are backing renewed construction of a border wall, former President Donald Trump's signature goal, while deeming large numbers of migrants ineligible for asylum and reviving a controversial policy under which asylum seekers are told to remain in Mexico while their immigration case is heard.  Biden said he was willing to make \"significant\" compromises on the border issue but said Republicans will not get everything they want. He did not provide details.  \"This has to be a negotiation,\" he said.  Biden, who had discussed Ukraine in a virtual summit with G7 leaders earlier on Wednesday, said U.S. allies are prepared to continue supporting Ukraine in its 22-month war to repel Russian invaders.",
  "upvote": 0,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717126d3f0f8420e26ab23"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T06:25:20.727Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:06:48.964Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716698d3f0f8420e26a8c0"
  },
  "userid": "657165c9d3f0f8420e26a8bb",
  "title": "Highlights | IND-W Vs ENG-W, 1st T20I LIVE Cricket Score and Updates: England Beat India By 38 Runs",
  "link": "https://zeenews.india.com/cricket/live-updates/highlights-cricket-score-ind-w-vs-eng-w-1st-t20i-match-cricket-match-today-india-women-vs-england-women-cricket-live-score-updates-wankhede-stadium-mumbai-harmanpreet-kaur-heather-knight-england-beat-india-by-38-runs-2695763",
  "content": "In the 1st T20I between India Women and England Women at Wankhede Stadium, Mumbai, England posted a formidable total of 197-6 in 20 overs. Notable contributions came from D Wyatt (75) and Nat Sciver-Brunt (77). The bowling effort by Renuka Singh (3 wickets) and Shreyanka Patil (2 wickets) helped restrict India to 159-6 in response. Shafali Verma top-scored for India with 52. England's Sophie Ecclestone was the standout bowler, taking 3 wickets for 15 runs. England secured a convincing 38-run victory. The match witnessed exciting moments, including a stunning dive by Capsey, a mix of boundaries, and a resilient bowling display. The comprehensive summary highlights the key performances and crucial moments in this thrilling encounter of the England Women tour of India, 2023.",
  "upvote": 2,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717cc5d3f0f8420e26ad12"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T06:30:48.206Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:06:45.541Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716708d3f0f8420e26a8c6"
  },
  "userid": "657165c9d3f0f8420e26a8bb",
  "title": "Lionel Messi named Time's Athlete of the Year for 2023",
  "link": "https://timesofindia.indiatimes.com/sports/football/top-stories/lionel-messi-named-times-athlete-of-the-year-for-2023/articleshow/105776070.cms?from=mdr",
  "content": "The 36-year-old was linked to both his former team, Barcelon ..  Read more at: http://timesofindia.indiatimes.com/articleshow/105776070.cms?from=mdr&utm_source=contentofinterest&utm_medium=text&utm_campaign=cppst",
  "upvote": 3,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T06:32:40.104Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:06:42.526Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "657167c1d3f0f8420e26a8d7"
  },
  "userid": "6571603ad3f0f8420e26a7a9",
  "title": "Bollywood news",
  "link": "https://www.businesstoday.in/trending/box-office/story/sam-bahadur-box-office-collection-day-6-vicky-kaushals-film-remains-steady-against-animal-carnage-makes-rs-36-crore-in-india-408512-2023-12-07",
  "content": "'Sam Bahadur' box office collection day 6: Vicky Kaushal's film remains steady against 'Animal' carnage! Makes Rs 36 crore in India",
  "upvote": 4,
  "downvote": 0,
  "replies": [
    {
      "$oid": "6571688ed3f0f8420e26a92a"
    }
  ],
  "noofreplies": 3,
  "createdAt": {
    "$date": "2023-12-07T06:35:45.057Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:06:35.645Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716865d3f0f8420e26a903"
  },
  "userid": "657165c9d3f0f8420e26a8bb",
  "title": "Those saying Kohli will break Tendulkar's 100 centuries record are illogical in cricketing terms: Brian Lara",
  "link": "https://www.hindustantimes.com/cricket/saying-kohli-will-break-tendulkars-100-centuries-record-is-illogical-in-cricketing-terms-brian-lara-101701884180423.html",
  "content": "It was humungous. It was historic. But it was never unthinkable, especially for the last five or six years. Virat Kohli going past Sachin Tendulkar's 49 ODI centuries was on the cards. Very few batters have dominated world cricket in all three formats like Kohli has but if one is asked to choose a format where they would want Kohli to bat for their lives, it is likely to be the ODIs. Kohli has bossed 50-over cricket. Even when his runs dried up in other formats between 2019 and 2022, he was going strong in ODIs. Therefore, when the moment finally came and that too in a World Cup semi-final against New Zealand, dare we say, it seemed inevitable. Kohli became the first cricketer to reach 50 centuries in ODI cricket.The format may not be the most favourable one right now but one can bet that he is likely to add a few more to that tally before finishing as an international cricketer. But the real challenge for Kohli is to get past Tendulkar's 100 international centuries. He has 80 right now. India only have five ODIs scheduled next year and there is still no clarity about his T20I future - he hasn't played that format since December 2022. If Kohli has to match or go past Tendulkar then he will majorly have to bank on red-ball cricket. If he continues to play at full fitness for the next four years, he will have to score five centuries each year to match Tendulkar. That is not easy.That is exactly why, despite being a big fan of Kohli's batting, the legendary Brian Lara is not optimistic about it. \"How old is Kohli now? 35, right? He has 80 but still needs 20. If he scores five centuries every year he'd need four more years to equal Tendulkar. Kohli will be 39 then. Tough job, very tough job,\" Lara told Anandabazar Patrika.  ‘Kohli will break many records but 100 centuries seems difficult’: Lara The former West Indies captain said it doesn't seem logical from a cricketing perspective. \"Can't say with certainty, no one can. Those saying Kohli will break Tendulkar's 100-centuries record won't be taking cricketing logic into account. 20 centuries seem a long way away. Most cricketers can't score that in their entire career. I won't be adventurous and say Kohli will do it,\" he added. “Age doesn't stop for anyone. Kohli will break many more records but 100 centuries seems the most difficult one.”",
  "upvote": 2,
  "downvote": 1,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T06:38:29.331Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:05:56.756Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716ecad3f0f8420e26aacc"
  },
  "userid": "65716e67d3f0f8420e26aac5",
  "title": "Terrorism Returns to France",
  "link": "https://www.geopoliticalmonitor.com/terrorism-returns-to-france/",
  "content": "“France is under a long-term terrorist threat.” The words of the Ministry of the Interior resound with harshness in all French people’s hearts, after another weekend of horror. The October 2 jihadist attack in the heart of Paris was (another) reminder of the persistent terrorist threat in France. In the lead up to the most anticipated sporting event in the country since the 2018 Football World Cup, the Olympic Games, all eyes will be on the French capital, and the security forces’ capability to keep Olympians, tourists, and locals safe.",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:05:46.416Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:05:53.135Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716eeed3f0f8420e26aad2"
  },
  "userid": "65716e67d3f0f8420e26aac5",
  "title": "What are France’s Motives in the South Caucasus?",
  "link": "https://www.geopoliticalmonitor.com/what-are-frances-motives-in-the-south-caucasus/",
  "content": "As widely reported, France has recently agreed to sell an advanced air defence system, the Thales GM 200, to Armenia. In addition, the two countries have signed a memorandum of understanding according to which France will sell Armenia the Mistral short-range air defence system sometime in the future. Armenia, however, is already covered by a joint air-defence system with Russia. This was agreed between the two countries in 2015, and in 2016 the Armenian parliament ratified the agreement.  One might reasonably question why a NATO member is selling advanced technology to a member of the Russian-led Collective Security Treaty Organization (CSTO). Russia’s operational control over Armenia’s air defences makes it certain that the Russian military will scrutinize this technology and perhaps even appropriate it.  These relations raise the likelihood that the system will be inspected and reverse-engineered by Armenia’s (and Russia’s) ally Iran, which has already significantly penetrated Armenia’s military-industrial complex. Iran has also exported drones and drone-manufacturing capability to Russia for use against Ukraine.  One finds oneself asking, in colloquial terms: “What could France be thinking?” In fact, French diplomatic history sheds light on the situation, which has little to do with Armenia and everything to do with France’s centuries-long diplomatic conflicts and competition with Turkey on the one hand and, on the other hand, Britain.",
  "upvote": 2,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717c85d3f0f8420e26accb"
    }
  ],
  "noofreplies": 2,
  "createdAt": {
    "$date": "2023-12-07T07:06:22.197Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:25:58.568Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716f19d3f0f8420e26aad8"
  },
  "userid": "65716e67d3f0f8420e26aac5",
  "title": "Rebels Go on the Offensive in Myanmar",
  "link": "https://www.geopoliticalmonitor.com/rebels-go-on-the-offensive-in-myanmar/",
  "content": "The armed insurgency offensive led by ethnic armed groups against the junta in Myanmar is expanding both in scale and intensity. Commencing with an initial offensive in the northern part of Shan state on October 27, various groups in different regions, such as Rakhine and Karen states, have initiated their own operations. The military appears stretched thin and has encountered limited success in reclaiming territories that were lost. ",
  "upvote": 3,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:07:05.738Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:17:33.889Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65716f32d3f0f8420e26aade"
  },
  "userid": "65716e67d3f0f8420e26aac5",
  "title": "Supreme Court Ruling Lands a Blow against Mining Interests in Panama",
  "link": "https://www.geopoliticalmonitor.com/supreme-court-ruling-lands-a-blow-against-mining-interests-in-panama/",
  "content": "Panama’s Supreme Court issued a historical ruling on 28 November. After deliberating for less than a week, the judiciary of the Central American country determined that a controversial and very unpopular contract between Canada’s First Quantum Minerals and the government of Panama is “unconstitutional.” While the dust still needs to settle, and repercussions are expected, including potential legal actions by First Quantum, the decision is a significant victory for the Panamanian environment and the people’s voice.",
  "upvote": 3,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:07:30.244Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:17:30.057Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571727ed3f0f8420e26ab52"
  },
  "userid": "657171dad3f0f8420e26ab48",
  "title": "Will attend next INDIA bloc meet, seek swift call on plans: Nitish Kumar",
  "link": "https://timesofindia.indiatimes.com/city/patna/will-attend-next-india-bloc-meet-seek-swift-call-on-plans-nitish-kumar/articleshow/105795413.cms?from=mdr",
  "content": "Bihar CM Nitish Kumar plans to attend the next INDIA bloc meeting in Delhi and will urge opposition allies to finalize strategies against the BJP-led NDA for the 2024 Lok Sabha polls. He wants all parties to work swiftly and not delay any further. Nitish Kumar reiterated his desire to unite the opposition parties for the country's benefit, without seeking any post in the INDIA bloc. He also confirmed that he will share a dais with HM Amit Shah at the East Zonal Council meeting in Patna.",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:21:34.897Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:17:23.903Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "657172bcd3f0f8420e26ab61"
  },
  "userid": "657171dad3f0f8420e26ab48",
  "title": "How India's 'national security' concerns has made Apple rework its strategy for iPhones made in India",
  "link": "https://timesofindia.indiatimes.com/gadgets-news/how-indias-national-security-concerns-has-made-apple-rework-its-strategy-for-iphones-made-in-india/articleshow/105785529.cms?_gl=1*1ete2cc*_ga*MTI1MTAxMzk2Ni4xNzAxOTMzNjM4*_ga_FCN624MN68*MTcwMTkzMzYzNy4xLjEuMTcwMTkzMzY0OS40OC4wLjA.#_ga=2.261028045.1138435991.1701933638-1251013966.1701933638",
  "content": "Apple is seeking new suppliers, including Indian, Japanese, and South Korean component makers, due to delayed government clearances for imports from existing Chinese suppliers. The company aims to establish \"just-in-time\" supply chains in India to expedite local production of flagship iPhones and iPads. While 14 Chinese companies received initial approvals to set up manufacturing facilities in India, the applications of four companies have been indefinitely delayed.",
  "upvote": 4,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717d3dd3f0f8420e26ae2d"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T07:22:36.211Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:07:25.700Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571731cd3f0f8420e26ab81"
  },
  "userid": "657171dad3f0f8420e26ab48",
  "title": "The story behind Giorgia Meloni’s ‘anti-anxiety’ phone case in selfie with PM Modi",
  "link": "https://www.indiatoday.in/trending-news/story/italian-pm-giorgia-melonis-viral-selfie-with-pm-modi-spotlights-anti-anxiety-phone-case-at-cop-28-2472060-2023-12-05",
  "content": "Italian Prime Minister Giorgia Meloni made headlines earlier this week after her selfie with Prime Minister Narendra Modi at COP28 went viral. But now, it is her phone case that has truly captured the attention of social media users.  Several pictures of PM Meloni's phone case are doing the rounds of the internet that show it features messages aimed at aiding those who suffer from anxiety. The one-liners promote self-worth, and boost confidence in achieving goals.",
  "upvote": 3,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:24:12.453Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:05:21.449Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65717366d3f0f8420e26ab87"
  },
  "userid": "657171dad3f0f8420e26ab48",
  "title": "Uncertainty over Rajasthan chief ministerial face, Vasundhara Raje reaches Delhi",
  "link": "https://www.indiatoday.in/elections/rajasthan-assembly-polls-2023/story/rajasthan-chief-minister-vasundhara-raje-bjp-balak-nath-delhi-2472914-2023-12-06",
  "content": "Amid uncertainty over the BJP's choice for the chief minister of Rajasthan, senior leader and former CM Vasundhara Raje landed in New Delhi on Wednesday to meet party leadership.  Sources said that Vasundhara Raje has sought time to meet BJP President JP Nadda and they could hold discussions on Thursday morning.  A two-time Chief Minister, Vasundhara Raje is one of the contenders for the CM post after BJP's sweeping victory in the recently concluded Rajasthan Assembly polls.",
  "upvote": 4,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:25:26.378Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:05:11.902Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571790dd3f0f8420e26ac38"
  },
  "userid": "6570a1410e7079ef5eaba860",
  "title": "Biden administration to forgive $4.8 billion in student loan debt for 80,300 borrowers",
  "link": "https://flipboard.com/topic/news/biden-administration-to-forgive-4-8-billion-in-student-loan-debt-for-80-300-bor/f-0a28f30d66%2Fcnbc.com",
  "content": "The Biden administration announced Wednesday that it would forgive an additional $4.8 billion in student loan debt, for 80,300 borrowers. ",
  "upvote": 1,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717dc1d3f0f8420e26aec5"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T07:49:33.901Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:09:37.358Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571794ed3f0f8420e26ac3e"
  },
  "userid": "6570a1410e7079ef5eaba860",
  "title": "iPhone users are experiencing a nasty iOS 17 bug, but there’s a workaround",
  "link": "https://flipboard.com/@kitarrowsmith/apple-j990han3z/iphone-users-are-experiencing-a-nasty-ios-17-bug-but-there-s-a-workaround/a-rofmRlj2Rz2j7KP2_RzPqg%3Aa%3A1849012808-e7a0f6b2e9%2Ftechradar.com",
  "content": "It’s not unusual for mobile operating systems to come with bugs, and that’s true for both iOS and Android. But iPhone users have recently noticed …",
  "upvote": 0,
  "downvote": 2,
  "replies": [
    {
      "$oid": "65717c29d3f0f8420e26aca3"
    }
  ],
  "noofreplies": 2,
  "createdAt": {
    "$date": "2023-12-07T07:50:38.780Z"
  },
  "updatedAt": {
    "$date": "2023-12-08T18:51:40.742Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65717b07d3f0f8420e26ac69"
  },
  "userid": "65717a82d3f0f8420e26ac64",
  "title": "Cyclone Michaung: Rajnath Singh to survey flood damage as schools shut in Chennai",
  "link": "",
  "content": "As Cyclone Michaung continues to weaken after making its landfall in Andhra Pradesh on Tuesday, several coastal states, especially Tamil Nadu and Odisha, are still reeling under its impact. Rains induced by the cyclone have caused severe flooding in Tamil Nadu, leading to the closure of schools and colleges in at least four Tamil Nadu states, cancellation of 15 trains to or from Chennai and damage to crops in Odisha.",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T07:57:59.370Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:08:56.453Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65717bcfd3f0f8420e26ac90"
  },
  "userid": "65717a82d3f0f8420e26ac64",
  "title": "Revanth Reddy takes oath as first Congress CM of Telangana",
  "link": "https://indianexpress.com/article/cities/hyderabad/telangana-cm-revanth-reddy-swearing-in-live-updates-congress-9057848/",
  "content": " Revanth Reddy was sworn in as the chief minister of Telangana by Governor Dr Tamilisai Soundararajan at the L B Stadium in Hyderabad, while Mallu Bhatti Vikramarka was sworn in as his deputy. As many as 10 other ministers, namely N Uttam Kumar Reddy, Komatireddy Venkat Reddy, Ponnam Prabhakar, Dasari Anasuya, Damodar Raja Narasimha, D Sridhar Babu, Thummala Nageshwara Rao, Ponguleti Srinivasa Reddy, Konda Surekha, and Jupally Krishna Rao, will also be sworn in by Governor Dr Tamilisai Soundararajan.",
  "upvote": 2,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717d01d3f0f8420e26ad93"
    },
    {
      "$oid": "65717e84d3f0f8420e26af36"
    },
    {
      "$oid": "657180e1d3f0f8420e26aff5"
    }
  ],
  "noofreplies": 5,
  "createdAt": {
    "$date": "2023-12-07T08:01:19.785Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:23:32.706Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65717d3fd3f0f8420e26ae36"
  },
  "userid": "65708d1aab8bf77685f92acc",
  "title": "Jungle Olympics",
  "link": "",
  "content": "History : A tortoise won the race against the rabbit !!!",
  "upvote": 1,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65717dc4d3f0f8420e26aed1"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T08:07:27.885Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:25:59.322Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65717e15d3f0f8420e26af17"
  },
  "userid": "657171b7d3f0f8420e26ab41",
  "title": "Ios 17.2 Developer beta released ",
  "link": "",
  "content": "Stable developer beta is released ",
  "upvote": 2,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65718260d3f0f8420e26b145"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T08:11:01.442Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:29:20.186Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65718078d3f0f8420e26afc2"
  },
  "userid": "657171dad3f0f8420e26ab48",
  "title": "China's ex-Foreign Minister Qin Gang dead due to suicide or torture: Report",
  "link": "https://www.indiatoday.in/world/story/qin-gang-china-former-foreign-minister-death-news-torture-suicide-2473006-2023-12-07",
  "content": "China's former Foreign Minister Qin Gang, who was ousted from his position in July, has reportedly died, either from suicide or torture.  According to a report with Politico, two people with access to top Chinese officials have claimed that Qin died in late July at a military hospital in Beijing.  The hospital reportedly treats top leaders of the country. Earlier, the Wall Street Journal reported that Qin had an extramarital affair while he was ambassador to the United States. It also mentioned that the former foreign minister was cooperating with the investigation, which was focused on whether the affair or Qin's conduct had compromised China's national security.Senior Chinese officials were told that an internal Communist Party investigation found Qin engaged in the affair throughout his tenure as China's ambassador to the United States, the report said.  Two sources told the newspaper the affair had resulted in the birth of a child in the United States.  Further, in July, Qin was replaced by veteran diplomat Wang Yi as the foreign minister after a mysterious one-month absence from duties barely half a year into the job.",
  "upvote": 2,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65718246d3f0f8420e26b120"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T08:21:12.835Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:28:57.162Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "657180b7d3f0f8420e26afd7"
  },
  "userid": "65708d1aab8bf77685f92acc",
  "title": "Best street foods of India",
  "link": "https://www.holidify.com/pages/street-food-in-india-1549.html",
  "content": "Aloo Tikki, The Delectable Street Food in India. Puchkas, the Tiny Bombs from Bengal. The Famous Vada Pao of Aamchi Mumbai. Dabeli of Gujarat. Lakhanpur De Balley straight from Jammu and Kashmir. Momos, the King of Street Food in Delhi. Akki Rotti from Karnataka.",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T08:22:15.877Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:46:39.046Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65718121d3f0f8420e26b024"
  },
  "userid": "657171dad3f0f8420e26ab48",
  "title": "Vivo named accused as probe agency ED files chargesheet in money laundering case",
  "link": "https://www.indiatoday.in/india/story/vivo-named-accused-money-laundering-case-enforcement-directorate-chargesheet-2473049-2023-12-07",
  "content": "Chinese smartphone maker Vivo was on Thursday named an accused in the Enforcement Directorate chargesheet in connection with a money laundering case. The complaint against Vivo was filed under the criminal sections of the Prevention of Money Laundering Act (PMLA).  Earlier, the probe agency had arrested four people, including Hari Om Rai - the Managing Director of the Lava International mobile company, in this investigation. The others who were taken into custody were Chinese national Guangwen alias Andrew Kuang, Chartered Accountants Nitin Garg and Rajan Malik. The ED had then claimed in its remand papers before a local court that the alleged activities of the four enabled Vivo-India to make wrongful gains that were detrimental to the economic sovereignty of India.  It had raided Vivo-India and its linked persons in July last year, claiming to have busted a major money laundering racket involving Chinese nationals and multiple Indian companies. Parliament Winter Session Cyclone Michaung Israel-Hamas War COP28 Elections 2023 The ED had then alleged that a whopping Rs 62,476 crore was \"illegally\" transferred by Vivo-India to China to avoid payment of taxes in India.  The company had said that it \"firmly adheres to its ethical principles and remains dedicated to legal compliance.\"  Rai had recently told a court that though his company and Vivo-India were in talks to launch a joint venture in India a decade ago, he had nothing to do with the Chinese firm or its representatives since 2014. With PTI inputs Published By",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T08:24:01.905Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:25:39.296Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "657181c5d3f0f8420e26b0b0"
  },
  "userid": "657180a8d3f0f8420e26afd2",
  "title": "Russia's President Vladimir Putin meets Saudi crown prince",
  "link": "https://www.reuters.com/world/middle-east/putin-talk-oil-uae-saudi-meet-crown-prince-mohammed-bin-salman-2023-12-06/",
  "content": "On Wednesday, Saudi Crown Prince Mohammed bin Salman and Russian President Vladimir Putin talked about expanding their collaboration on oil prices.  Hours after the head of the Kremlin's visit to the United Arab Emirates, Saudi Arabia's Gulf neighbour, Putin held hurried discussions with the crown prince, who is de facto the head of the world's biggest oil exporter. The conference was held following a decline in oil prices in spite of an agreement by OPEC+ to further reduce supply.",
  "upvote": 1,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T08:26:45.776Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:28:11.298Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "657181f9d3f0f8420e26b0d6"
  },
  "userid": "65716c00d3f0f8420e26aa55",
  "title": "AIIMS Delhi detects 7 samples of bacterium that causes ‘Walking Pneumonia’; Ministry says ‘not linked with China’s outbreak’",
  "link": "https://www.financialexpress.com/healthcare/news-healthcare/aiims-delhi-detects-7-samples-of-bacterium-that-causes-walking-pneumonia-ministry-says-not-linked-with-chinas-outbreak/3330588/",
  "content": "The All India Institute of Medical Sciences (AIIMS) has detected seven samples of Mycoplasma pneumoniae, bacterium linked with the cause of ‘Walking Pneumonia’.  Since, October this year, cases of ‘Walking Pneumonia’ have been reported in several part of the world including China.  Reportedly, the seven cases have been detected between April and September this year. The cases have been reported in a study published in the Lancet Microbe journal. According to the study, one case was reported through PCR test carried out at the early stages of the infection and the other 6 cases were reported through IgM Elisa test.On Thursday, the Health Ministry issued a statement claiming that these “seven cases have no link whatsoever to the recent surge in respiratory infections in children reported from some parts of the world, including China.”  “The seven cases have been detected as a part of an ongoing study at AIIMS Delhi in the six month period (April to September 2023) and is no cause for worry. Since January 2023 till date, NO Mycoplasma pneumonia was detected in the 611 samples tested at the Department of Microbiology, AIIMS Delhi as a part ICMR’s multiple respiratory pathogen surveillance, which included mainly severe acute respiratory illness (SARI, which comprised about 95% of these cases) by real-time PCR. Mycoplasma pneumonia is the commonest bacterial cause of community acquired pneumonia. It is the reason for nearly 15-30% of all such infections. Such surge has not been reported from any part of India,” the Ministry said in a statement.",
  "upvote": 1,
  "downvote": 0,
  "replies": [
    {
      "$oid": "65718229d3f0f8420e26b10a"
    }
  ],
  "noofreplies": 1,
  "createdAt": {
    "$date": "2023-12-07T08:27:37.929Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T08:28:25.790Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "65719202cc0a78fcd22fe89d"
  },
  "userid": "65708d1aab8bf77685f92acc",
  "title": "sports news",
  "link": "https://indianexpress.com/section/sports/",
  "content": "SPORTS NEWS Former India Test cricketers S Sreesanth and Gautam Gambhir got into a heated argument and exchanged words during a Legends League match between Gujarat Giants and India Capitals ‘F**k off fixer’: Sreesanth reveals what Gautam Gambhir said to him during angry exchange DECEMBER 7, 2023 14:42 IST On Wednesday, Sreesanth had posted a video where he said that Gambhir had called him something which was very rude.  President of Spain's soccer federation, Luis Rubiales, left, stands stands next to Spain Head Coach Jorge Vilda Luis Rubiales also ‘forcefully kissed’ England women’s footballer on her face at Women’s World Cup",
  "upvote": 0,
  "downvote": 0,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T09:36:02.666Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T09:36:02.666Z"
  },
  "__v": 0
},
{
  "_id": {
    "$oid": "6571c3f1d8e69b08691c1333"
  },
  "userid": "65708d1aab8bf77685f92acc",
  "title": "Final News",
  "link": "https://www.thequint.com/neon/social-buzz/explained-what-is-moye-moye-the-trend-that-has-taken-the-internet-by-storm",
  "content": "News feeding ",
  "upvote": 0,
  "downvote": 1,
  "replies": [],
  "noofreplies": 0,
  "createdAt": {
    "$date": "2023-12-07T13:09:05.942Z"
  },
  "updatedAt": {
    "$date": "2023-12-07T13:09:22.674Z"
  },
  "__v": 0
}]